---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RepeatingDetailSpacing
source: html/652f8534-4dfa-7c46-199f-b91c5c83761b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RepeatingDetailSpacing Property

"Spacing"

## Syntax (C#)
```csharp
public static ForgeTypeId RepeatingDetailSpacing { get; }
```